<div>
    <section class="s-blog-info">
        <div class="prs-responsive">
            <div class="container-fluid">
                <div class="row">
                    <div class="col-md-10 m-auto-x blog-info-page">
                        <div class="address-bar pb-5">
                            <div class="right-address-bar">
                                <svg class="location-svg" xmlns="http://www.w3.org/2000/svg" width="17.642"
                                     height="20.742" viewBox="0 0 17.642 20.742">
                                    <g id="Location" transform="translate(-0.229 -0.25)">
                                        <path id="Path_1011" data-name="Path 1011"
                                              d="M1.114,10.586a11.93,11.93,0,0,0,3.1,6.039,19.469,19.469,0,0,0,4.1,3.38,1.356,1.356,0,0,0,1.471,0,19.47,19.47,0,0,0,4.1-3.38,11.93,11.93,0,0,0,3.1-6.039,9.156,9.156,0,0,0-1.242-6.267A7.488,7.488,0,0,0,9.05,1,7.488,7.488,0,0,0,2.356,4.319,9.156,9.156,0,0,0,1.114,10.586Z"
                                              transform="translate(0)" fill="none" stroke="#212135"
                                              stroke-linecap="round"
                                              stroke-linejoin="round" stroke-width="1.5"/>
                                        <circle id="Ellipse_49" data-name="Ellipse 49" cx="3" cy="3" r="3"
                                                transform="translate(12.013 12.142) rotate(180)" fill="none"
                                                stroke="#212135"
                                                stroke-width="1.5"/>
                                    </g>
                                </svg>
                                <a>آکادمی مریم صفایی</a>
                                <svg class="arrow-svg" xmlns="http://www.w3.org/2000/svg" width="14.249"
                                     height="9.697" viewBox="0 0 14.249 9.697">
                                    <path id="Up_Arrow_2" data-name="Up Arrow 2" d="M1,5,5,1M5,1V13.8M5,1,9,5"
                                          transform="translate(-0.151 9.849) rotate(-90)" fill="none"
                                          stroke="#212135" stroke-linecap="round" stroke-linejoin="round"
                                          stroke-width="1.2"/>
                                </svg>
                                <a>لیست مطالب</a>
                                <svg class="arrow-svg" xmlns="http://www.w3.org/2000/svg" width="14.249"
                                     height="9.697" viewBox="0 0 14.249 9.697">
                                    <path id="Up_Arrow_2" data-name="Up Arrow 2" d="M1,5,5,1M5,1V13.8M5,1,9,5"
                                          transform="translate(-0.151 9.849) rotate(-90)" fill="none"
                                          stroke="#212135" stroke-linecap="round" stroke-linejoin="round"
                                          stroke-width="1.2"/>
                                </svg>
                                <a>{{ $post->title }}</a>
                            </div>
                        </div>
                        <div class="top-main-parent">
                            <div class="img-main-blog-info">
                                <img src="{{ $post->files->firstWhere('type' , 1)->url ?? '/images/noPicture.png' }}"
                                     alt="">
                            </div>
                            <div class="text-blog-info">
                                <i class="icon-circle"></i>
                                <h2>{{ $post->title }}</h2>
                            </div>
                            <div class="information-blog-item">
                                <div class="number-visit">
                                    <div class="visit">
                                        <svg id="Filled" viewBox="0 0 24 24" width="25" height="25">
                                            <path
                                                d="M23,16a1,1,0,0,0-1,1v2a3,3,0,0,1-3,3H17a1,1,0,0,0,0,2h2a5.006,5.006,0,0,0,5-5V17A1,1,0,0,0,23,16Z"/>
                                            <path
                                                d="M1,8A1,1,0,0,0,2,7V5A3,3,0,0,1,5,2H7A1,1,0,0,0,7,0H5A5.006,5.006,0,0,0,0,5V7A1,1,0,0,0,1,8Z"/>
                                            <path
                                                d="M7,22H5a3,3,0,0,1-3-3V17a1,1,0,0,0-2,0v2a5.006,5.006,0,0,0,5,5H7a1,1,0,0,0,0-2Z"/>
                                            <path
                                                d="M19,0H17a1,1,0,0,0,0,2h2a3,3,0,0,1,3,3V7a1,1,0,0,0,2,0V5A5.006,5.006,0,0,0,19,0Z"/>
                                            <circle cx="12" cy="7" r="4"/>
                                            <path
                                                d="M11,13a6.006,6.006,0,0,0-6,6,1,1,0,0,0,1,1H18a1,1,0,0,0,1-1,6.006,6.006,0,0,0-6-6Z"/>
                                        </svg>
                                        <span>{{ $post->visitCount() }} بازدید</span>
                                    </div>
                                    <div class="date-blog-information">
                                        <span>{{ jdate($post->created_at)->format('Y/m/d') }}</span>
                                    </div>
                                </div>
                                <div class="social-media" x-data>
                                    <span>شبکه های اجتماعی:</span>
                                    <div class="icon-social-media">
                                        <a href="https://www.instagram.com/?url={{ $post->path() }}" target="_blank" class="instagram">
                                            <svg version="1.1" id="Capa_1" x="0px" y="0px" viewBox="0 0 24 24"
                                                 style="enable-background:new 0 0 24 24;" xml:space="preserve"
                                                 width="25"
                                                 height="25">
<g>
    <path
        d="M12,2.162c3.204,0,3.584,0.012,4.849,0.07c1.308,0.06,2.655,0.358,3.608,1.311c0.962,0.962,1.251,2.296,1.311,3.608   c0.058,1.265,0.07,1.645,0.07,4.849c0,3.204-0.012,3.584-0.07,4.849c-0.059,1.301-0.364,2.661-1.311,3.608   c-0.962,0.962-2.295,1.251-3.608,1.311c-1.265,0.058-1.645,0.07-4.849,0.07s-3.584-0.012-4.849-0.07   c-1.291-0.059-2.669-0.371-3.608-1.311c-0.957-0.957-1.251-2.304-1.311-3.608c-0.058-1.265-0.07-1.645-0.07-4.849   c0-3.204,0.012-3.584,0.07-4.849c0.059-1.296,0.367-2.664,1.311-3.608c0.96-0.96,2.299-1.251,3.608-1.311   C8.416,2.174,8.796,2.162,12,2.162 M12,0C8.741,0,8.332,0.014,7.052,0.072C5.197,0.157,3.355,0.673,2.014,2.014   C0.668,3.36,0.157,5.198,0.072,7.052C0.014,8.332,0,8.741,0,12c0,3.259,0.014,3.668,0.072,4.948c0.085,1.853,0.603,3.7,1.942,5.038   c1.345,1.345,3.186,1.857,5.038,1.942C8.332,23.986,8.741,24,12,24c3.259,0,3.668-0.014,4.948-0.072   c1.854-0.085,3.698-0.602,5.038-1.942c1.347-1.347,1.857-3.184,1.942-5.038C23.986,15.668,24,15.259,24,12   c0-3.259-0.014-3.668-0.072-4.948c-0.085-1.855-0.602-3.698-1.942-5.038c-1.343-1.343-3.189-1.858-5.038-1.942   C15.668,0.014,15.259,0,12,0z"/>
    <path
        d="M12,5.838c-3.403,0-6.162,2.759-6.162,6.162c0,3.403,2.759,6.162,6.162,6.162s6.162-2.759,6.162-6.162   C18.162,8.597,15.403,5.838,12,5.838z M12,16c-2.209,0-4-1.791-4-4s1.791-4,4-4s4,1.791,4,4S14.209,16,12,16z"/>
    <circle cx="18.406" cy="5.594" r="1.44"/>
</g>
</svg>
                                        </a>
                                        <a href="whatsapp://send?text={{ $post->path() }}" target="_blank" class="whatsapp">
                                            <svg version="1.1" id="Capa_1" x="0px" y="0px"
                                                 width="30.667px" height="30.667px" viewBox="0 0 30.667 30.667"
                                                 style="enable-background:new 0 0 30.667 30.667;width: 25px;height: 25px"
                                                 xml:space="preserve">
<g>
    <path d="M30.667,14.939c0,8.25-6.74,14.938-15.056,14.938c-2.639,0-5.118-0.675-7.276-1.857L0,30.667l2.717-8.017
		c-1.37-2.25-2.159-4.892-2.159-7.712C0.559,6.688,7.297,0,15.613,0C23.928,0.002,30.667,6.689,30.667,14.939z M15.61,2.382
		c-6.979,0-12.656,5.634-12.656,12.56c0,2.748,0.896,5.292,2.411,7.362l-1.58,4.663l4.862-1.545c2,1.312,4.393,2.076,6.963,2.076
		c6.979,0,12.658-5.633,12.658-12.559C28.27,8.016,22.59,2.382,15.61,2.382z M23.214,18.38c-0.094-0.151-0.34-0.243-0.708-0.427
		c-0.367-0.184-2.184-1.069-2.521-1.189c-0.34-0.123-0.586-0.185-0.832,0.182c-0.243,0.367-0.951,1.191-1.168,1.437
		c-0.215,0.245-0.43,0.276-0.799,0.095c-0.369-0.186-1.559-0.57-2.969-1.817c-1.097-0.972-1.838-2.169-2.052-2.536
		c-0.217-0.366-0.022-0.564,0.161-0.746c0.165-0.165,0.369-0.428,0.554-0.643c0.185-0.213,0.246-0.364,0.369-0.609
		c0.121-0.245,0.06-0.458-0.031-0.643c-0.092-0.184-0.829-1.984-1.138-2.717c-0.307-0.732-0.614-0.611-0.83-0.611
		c-0.215,0-0.461-0.03-0.707-0.03S9.897,8.215,9.56,8.582s-1.291,1.252-1.291,3.054c0,1.804,1.321,3.543,1.506,3.787
		c0.186,0.243,2.554,4.062,6.305,5.528c3.753,1.465,3.753,0.976,4.429,0.914c0.678-0.062,2.184-0.885,2.49-1.739
		C23.307,19.268,23.307,18.533,23.214,18.38z"/>
</g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
                                                <g>
                                                </g>
</svg>
                                        </a>
                                        <a href="" @click.prevent="navigator.clipboard.writeText('{{ $post->path() }}'); $dispatch('toastMessage' , {'message': 'لینک صفحه کپی شد.' , 'icon' : 'info'})" class="instagram">
                                            <svg xmlns="http://www.w3.org/2000/svg" width="31" height="32" viewBox="0 0 31 32" fill="none"
                                                 style="enable-background:new 0 0 30.667 30.667;width: 25px;height: 25px">
                                                <path d="M19.3893 4.80273H11.7401C8.92374 4.80273 6.64062 7.09155 6.64062 9.91495V20.1394" stroke="#CCD2E3" stroke-width="2"/>
                                                <path d="M22.3824 10.2217L22.9769 9.44874L22.3824 10.2217C22.5782 10.3723 22.7536 10.5481 22.904 10.7446C23.1438 11.0579 23.3071 11.4865 23.3959 12.2762C23.4869 13.0859 23.4884 14.1439 23.4884 15.666V20.7782C23.4884 22.3003 23.4869 23.3584 23.3959 24.1681C23.3071 24.9577 23.1438 25.3864 22.904 25.6997C22.7536 25.8961 22.5782 26.0719 22.3824 26.2226C22.0705 26.4625 21.644 26.6259 20.8572 26.7148C20.05 26.806 18.9951 26.8075 17.4766 26.8075C15.9582 26.8075 14.9032 26.806 14.0961 26.7148C13.3093 26.6259 12.8827 26.4625 12.5709 26.2226C12.375 26.0719 12.1997 25.8961 12.0493 25.6997C11.8095 25.3864 11.6462 24.9577 11.5574 24.1681C11.4663 23.3584 11.4648 22.3003 11.4648 20.7782V15.666C11.4648 14.1439 11.4663 13.0859 11.5574 12.2762C11.6462 11.4865 11.8095 11.0579 12.0493 10.7446C12.1997 10.5481 12.375 10.3723 12.5709 10.2217C12.8827 9.98178 13.3093 9.81836 14.0961 9.72943C14.9032 9.63821 15.9582 9.63672 17.4766 9.63672C18.9951 9.63672 20.05 9.63821 20.8572 9.72943C21.644 9.81836 22.0705 9.98178 22.3824 10.2217Z" stroke="#CCD2E3" stroke-width="2"/>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </div>

                        <div class="blog-info-text editor">
                            {!! $post->body !!}
                        </div>
                        <x-parnas.pages.components.comments
                            :comments="$comments"></x-parnas.pages.components.comments>
                        <div class="parent-tags">
                            <strong>{{__('تگ ها')}} :</strong>
                            @forelse($post->tags()->get() as $tag)
                                <a class="item-tag">{{ $tag->name }}</a>
                            @empty
                                <span class="ms-2">{{ __('تگی ثبت نشده است') }}</span>
                            @endforelse
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
</div>
