<?php
return [
    'enums' => [
        'types' => [
            array('name' => 'academy' , 'label' => 'آکادمی' , 'id' => 2)
        ],
    ],
    'sidebar' => [
        'title' => 'دوره ها',
        'icon' => '<svg width="17" height="17" viewBox="0 0 28 28" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M12.984 3.40332C13.005 3.30664 13.0067 3.20675 12.9889 3.10943C12.9711 3.0121 12.9343 2.91925 12.8805 2.83623C12.8266 2.7532 12.7569 2.68165 12.6754 2.62568C12.5938 2.56971 12.5019 2.53044 12.4051 2.51012C12.3083 2.48981 12.2084 2.48885 12.1112 2.50731C12.014 2.52576 11.9214 2.56327 11.8387 2.61766C11.7561 2.67206 11.685 2.74227 11.6296 2.82425C11.5743 2.90622 11.5356 2.99835 11.516 3.09532L10.28 8.99932H3.75C3.55109 8.99932 3.36032 9.07834 3.21967 9.21899C3.07902 9.35964 3 9.55041 3 9.74932C3 9.94823 3.07902 10.139 3.21967 10.2796C3.36032 10.4203 3.55109 10.4993 3.75 10.4993H9.966L8.606 16.9993H2.75C2.55109 16.9993 2.36032 17.0783 2.21967 17.219C2.07902 17.3596 2 17.5504 2 17.7493C2 17.9482 2.07902 18.139 2.21967 18.2796C2.36032 18.4203 2.55109 18.4993 2.75 18.4993H8.292L7.016 24.5953C6.995 24.692 6.99334 24.7919 7.01111 24.8892C7.02888 24.9865 7.06573 25.0794 7.11954 25.1624C7.17335 25.2454 7.24306 25.317 7.32464 25.373C7.40623 25.4289 7.49808 25.4682 7.59491 25.4885C7.69174 25.5088 7.79163 25.5098 7.88883 25.4913C7.98603 25.4729 8.07862 25.4354 8.16126 25.381C8.2439 25.3266 8.31496 25.2564 8.37035 25.1744C8.42574 25.0924 8.46437 25.0003 8.484 24.9033L9.824 18.4993H16.292L15.016 24.5953C14.9767 24.7894 15.0158 24.9911 15.1246 25.1565C15.2335 25.3219 15.4033 25.4375 15.5971 25.4782C15.7909 25.5188 15.9929 25.4812 16.159 25.3735C16.3252 25.2658 16.442 25.0968 16.484 24.9033L17.824 18.4993H24.25C24.4489 18.4993 24.6397 18.4203 24.7803 18.2796C24.921 18.139 25 17.9482 25 17.7493C25 17.5504 24.921 17.3596 24.7803 17.219C24.6397 17.0783 24.4489 16.9993 24.25 16.9993H18.138L19.498 10.4993H25.25C25.4489 10.4993 25.6397 10.4203 25.7803 10.2796C25.921 10.139 26 9.94823 26 9.74932C26 9.55041 25.921 9.35964 25.7803 9.21899C25.6397 9.07834 25.4489 8.99932 25.25 8.99932H19.813L20.984 3.40332C21.005 3.30664 21.0067 3.20675 20.9889 3.10943C20.9711 3.0121 20.9343 2.91925 20.8805 2.83623C20.8266 2.7532 20.7569 2.68165 20.6754 2.62568C20.5938 2.56971 20.5019 2.53044 20.4051 2.51012C20.3083 2.48981 20.2084 2.48885 20.1112 2.50731C20.014 2.52576 19.9214 2.56327 19.8387 2.61766C19.7561 2.67206 19.685 2.74227 19.6296 2.82425C19.5743 2.90622 19.5356 2.99835 19.516 3.09532L18.28 8.99932H11.813L12.984 3.40332V3.40332ZM16.606 16.9993H10.138L11.498 10.4993H17.966L16.606 16.9993Z" fill="#A9B0A6"/>
                                    </svg>',
        'route' => 'admin.courses.index',
        'links' => array(),
        'can' => 'courses.read',
        'order' => 3
    ],
    'defaults' => [
        'statuses' => [
            array('name' => 'soon', 'type' => 2, 'label' => 'بزودی', 'color' => '#4BB543'),
            array('name' => 'performing', 'type' => 2, 'label' => 'در حال برگزاری', 'color' => '#FFCC00'),
            array('name' => 'completed', 'type' => 2, 'label' => 'تکمیل شده', 'color' => '#FFCC00'),
        ],
        'permission' => array(
            array('id' => 37,'name' => 'courses.read', 'label' => 'خواندن دوره ها'),
            array('id' => 38,'name' => 'courses.create', 'label' => 'ایجاد دوره ها'),
            array('id' => 39,'name' => 'courses.edit', 'label' => 'ویرایش دوره ها'),
            array('id' => 40,'name' => 'courses.delete', 'label' => 'حذف دوره ها'),

            array('id' => 43,'name' => 'leanings.read', 'label' => 'خواندن دوره های خریداری شده'),
            array('id' => 44,'name' => 'leanings.create', 'label' => 'ایجاد دوره های خریداری شده'),
            array('id' => 45,'name' => 'leanings.edit', 'label' => 'ویرایش دوره های خریداری شده'),
            array('id' => 46,'name' => 'leanings.delete', 'label' => 'حذف دوره های خریداری شده'),
        ),
        'permission_role' => array(
            array('role_id' => 1, 'permission_id' => [37 , 38 , 39 , 40 , 43 , 44 , 45 , 46]),
        ),
        'settings' => [
            'courses' => 'دوره-ها',
            'rial' => false,
            'expireLearning' => [
                'value' => '1 Year',
                'enums' => [
                    array('value' => '1 Month' , 'text' => 'یک ماه'),
                    array('value' => '2 Month' , 'text' => 'دو ماه'),
                    array('value' => '3 Month' , 'text' => 'سه ماه'),
                    array('value' => '4 Month' , 'text' => 'چهار ماه'),
                    array('value' => '5 Month' , 'text' => 'پنج ماه'),
                    array('value' => '6 Month' , 'text' => 'شش ماه'),
                    array('value' => '7 Month' , 'text' => 'هفت ماه'),
                    array('value' => '8 Month' , 'text' => 'هشت ماه'),
                    array('value' => '9 Month' , 'text' => 'نه ماه'),
                    array('value' => '10 Month' , 'text' => 'ده ماه'),
                    array('value' => '11 Month' , 'text' => 'یازده ماه'),
                    array('value' => '1 Year' , 'text' => 'یکسال'),
                ]
            ]
        ],
        'posts' => [
            array(
                'title' => 'دوره ها',
                'description' => '',
                'body' => '',
                'post_type' => 'page',
                'status_id' => 1,
            )
        ]
    ]
];
